# Parameter Type Id Rotate Disjoin Property

Source: https://www.revitapidocs.com/2026/74346402-41bc-1f17-8136-8be3e7c7247b.htm

---

| Parameter Type Id Rotate Disjoin Property |
| --- |

"Disjoin"
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ForgeTypeId RotateDisjoin { get; }
```

```
Public Shared ReadOnly Property RotateDisjoin As ForgeTypeId
	Get
```

```
public:
static property ForgeTypeId^ RotateDisjoin {
	ForgeTypeId^ get ();
}
```

```
static member RotateDisjoin : ForgeTypeId with get
```

#### Property Value

ForgeTypeId See Also

#### Reference

ParameterTypeId Class Autodesk.Revit.DB Namespace